#퀴즈

#1) 명령 실행순서에 따라 A구조, B구조, C구조로 나뉜다.
#A구조의 이름은?

#B구조의 이름은?

#C구조의 이름은?

#2) 조건문에 대한 설명중 옳은것은?

if 조건식:
    실행 코드 1

#1. if문 내부 코드를 작성할 때에는 반드시 들여쓰기를 해주어야 한다.  
#2. 만약 if 옆에 작성된 조건이 참이라면, if문 내부의 실행 코드 1이 실행된다.
#3. 만약 if 옆에 작성된 조건이 거짓이라면, 조건문 내부의 코드가 실행되지 않고 다음 코드로 넘어간다.
#3. 조건문 안의 실행 코드에는 반드시 콜론(:)을 붙여야 한다. 

#3) 조건문에 대한 설명 중 옳지 않은 것은?
if 조건식:
    실행 코드 1 
else:
    실행 코드 2

#1. else 다음에도 콜론(:)을 반드시 작성해야 합니다.
#2. if 옆에 작성된 조건식이 참이면, if문 내부의 실행 코드 1이 실행된다.
#3. 만약 조건이 거짓이면, else문 내부의 실행 코드 2가 실행된다.
#4. else 뒤에 조건을 작성한다.

#4) 조건문은 조건에 따라 다른 동작을 실행할 수 있도록 작성한 코드입니다. 조건문의 조건은 어떤 데이터 타입을 반환할까요?
#1. 문자열
#2. 정수형
#3. 실수형
#4. 불형

#5) 다음 조건문 중 바르게 작성한 것을 고르시오. 

1. '''a = 10

if a > 5:
print(10)


2. '''a = 10

if a > 5:
    print(10)''''''

#1)
#A구조의 이름은? 순차
#B구조의 이름은? 선택
#C구조의 이름은? 반복

#2)
# 1,2,3번이 옳은 답이다.
# 4번이 옳지 않은 답이다. 조건문 안의 실행 코드에는 반드시 콜론(:)을 붙여야 한다.

#3)
# 4번이 옳지 않은 답이다. else 뒤에는 조건을 작성할 수 없다.

#4)
#4번이 정답이다. 조건문은 불형을 반환한다.

#5)
#2번이 바르게 작성한 조건문이다. if문 내부 코드를 작성할 때에는 반드시 들여쓰기를 해주어야 한다.